#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
azurerm_resource_group.main: Refreshing state... [id=/subscriptions/1e848775-2b7f-4f89-a40f-4ed805d70e2b/resourceGroups/Neo_Collectius_Group]
azurerm_storage_account.main: Refreshing state... [id=/subscriptions/1e848775-2b7f-4f89-a40f-4ed805d70e2b/resourceGroups/Neo_Collectius_Group/providers/Microsoft.Storage/storageAccounts/collectiusdemostoracc]
azurerm_service_plan.main: Refreshing state... [id=/subscriptions/1e848775-2b7f-4f89-a40f-4ed805d70e2b/resourceGroups/Neo_Collectius_Group/providers/Microsoft.Web/serverfarms/collectiusdemo-asp]
azurerm_kubernetes_cluster.ak8s: Refreshing state... [id=/subscriptions/1e848775-2b7f-4f89-a40f-4ed805d70e2b/resourceGroups/Neo_Collectius_Group/providers/Microsoft.ContainerService/managedClusters/ak8s]
azurerm_linux_function_app.main: Refreshing state... [id=/subscriptions/1e848775-2b7f-4f89-a40f-4ed805d70e2b/resourceGroups/Neo_Collectius_Group/providers/Microsoft.Web/sites/collectiusdemo-function]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # azurerm_kubernetes_cluster.ak8s has been deleted
  - resource "azurerm_kubernetes_cluster" "ak8s" {
      - fqdn                                = "ak8s-u4afi6m1.hcp.westus3.azmk8s.io" -> null
        id                                  = "/subscriptions/1e848775-2b7f-4f89-a40f-4ed805d70e2b/resourceGroups/Neo_Collectius_Group/providers/Microsoft.ContainerService/managedClusters/ak8s"
      - kube_config                         = (sensitive value) -> null
      - kube_config_raw                     = (sensitive value) -> null
        name                                = "ak8s"
        tags                                = {
            "Environment" = "Dev"
        }
        # (21 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_kubernetes_cluster.ak8s will be created
  + resource "azurerm_kubernetes_cluster" "ak8s" {
      + api_server_authorized_ip_ranges     = (known after apply)
      + dns_prefix                          = "ak8s"
      + fqdn                                = (known after apply)
      + http_application_routing_zone_name  = (known after apply)
      + id                                  = (known after apply)
      + image_cleaner_enabled               = false
      + image_cleaner_interval_hours        = 48
      + kube_admin_config                   = (sensitive value)
      + kube_admin_config_raw               = (sensitive value)
      + kube_config                         = (sensitive value)
      + kube_config_raw                     = (sensitive value)
      + kubernetes_version                  = (known after apply)
      + location                            = "westus3"
      + name                                = "ak8s"
      + node_resource_group                 = (known after apply)
      + node_resource_group_id              = (known after apply)
      + oidc_issuer_url                     = (known after apply)
      + portal_fqdn                         = (known after apply)
      + private_cluster_enabled             = false
      + private_cluster_public_fqdn_enabled = false
      + private_dns_zone_id                 = (known after apply)
      + private_fqdn                        = (known after apply)
      + public_network_access_enabled       = true
      + resource_group_name                 = "Neo_Collectius_Group"
      + role_based_access_control_enabled   = true
      + run_command_enabled                 = true
      + sku_tier                            = "Free"
      + tags                                = {
          + "Environment" = "Dev"
        }
      + workload_identity_enabled           = false

      + default_node_pool {
          + kubelet_disk_type    = (known after apply)
          + max_pods             = (known after apply)
          + name                 = "agentpool"
          + node_count           = 3
          + node_labels          = (known after apply)
          + orchestrator_version = (known after apply)
          + os_disk_size_gb      = (known after apply)
          + os_disk_type         = "Managed"
          + os_sku               = (known after apply)
          + scale_down_mode      = "Delete"
          + type                 = "VirtualMachineScaleSets"
          + ultra_ssd_enabled    = false
          + vm_size              = "Standard_B4ms"
          + workload_runtime     = (known after apply)
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + network_profile {
          + dns_service_ip     = (known after apply)
          + docker_bridge_cidr = (known after apply)
          + ip_versions        = (known after apply)
          + load_balancer_sku  = "standard"
          + network_mode       = (known after apply)
          + network_plugin     = "kubenet"
          + network_policy     = (known after apply)
          + outbound_type      = "loadBalancer"
          + pod_cidr           = (known after apply)
          + pod_cidrs          = (known after apply)
          + service_cidr       = (known after apply)
          + service_cidrs      = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ client_certificate     = (sensitive value)
  ~ client_key             = (sensitive value)
  ~ cluster_ca_certificate = (sensitive value)
  ~ cluster_password       = (sensitive value)
  ~ cluster_username       = (sensitive value)
  ~ fqdn                   = "ak8s-u4afi6m1.hcp.westus3.azmk8s.io" -> (known after apply)
  ~ host                   = (sensitive value)
  ~ kube_config            = (sensitive value)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @rvind92, Action: `pull_request`*